---
kind: method
id: M:Autodesk.Revit.DB.SolidUtils.Clone(Autodesk.Revit.DB.Solid)
source: html/2e985cf8-cdce-2045-c5d8-5a06fd49c002.htm
---
# Autodesk.Revit.DB.SolidUtils.Clone Method

Creates a new Solid which is a copy of the input Solid.

## Syntax (C#)
```csharp
public static Solid Clone(
	Solid solid
)
```

## Parameters
- **solid** (`Autodesk.Revit.DB.Solid`) - The input solid to be copied.

## Returns
The newly created Solid.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null